Tekla Open API Reference for Tekla Structures 2025
AnalysisMember.CopyData Method
 Copies data from another analysis member.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void CopyData(
	AnalysisMember AnalysisMember
)
Public Sub CopyData (
	AnalysisMember As AnalysisMember
)
Parameters
AnalysisMember
Type: Tekla.Structures.Analysis.AnalysisMember
The analysis member to copy data from.
See Also
Reference
AnalysisMember Class
Tekla.Structures.Analysis Namespace